# Размеры Земли
EARTH_RADIUS = 6_371_000  # м
EARTH_MASS = 5.9722e24  # кг

# Астрономическая единица
AU = 149_597_870_700  # м

# Гравитационная постоянная
G = 6.67430e-11

# Цвета
YELLOW = (255, 255, 0)
BLUE = (0, 128, 255)
WHITE = (255, 255, 255)
RED = (255, 0, 0)
GREY = (128, 128, 128)
BEIGE = (244, 173, 102)
ORANGE = (193, 151, 68)
BACKGROUND_COLOR = (30, 30, 40)

# Размер окна
WIDTH = 2460
HEIGHT = 1340
CENTER_X = WIDTH // 2
CENTER_Y = HEIGHT // 2

# Настройки проги
PHYSICS_STEPS = 100

# Масштаб
# 1 а.е. = 200 пикселей
SCALE = AU / 200
